MacgyverLin/VGMPlayer/Software/STM32/HWModule/LCD2.c
	D0.type->ODR = d | d2;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;
#else	
	D0.type->ODR = d | d0;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;

	D0.type->ODR = d | d1;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;

	D0.type->ODR = d | d2;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;
#endif	

	/////////////////////////////////////
	LCD_CS.type->BSRR = LCD_CS.pin;
}

void LCD_WriteCommand4(u8 command, u8 d0, u8 d1, u8 d2, u8 d3)
{
	u16 d = (D0.type->ODR & 0x0000ff00);

	/////////////////////////////////////
	LCD_CS.type->BRR = LCD_CS.pin;

	/////////////////////////////////////
#ifdef CLK_E
	WR.type->BRR = WR.pin;

	A0.type->BRR = A0.pin;	
	D0.type->ODR = d | command;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;
#else		
	A0.type->BRR = A0.pin;
	D0.type->ODR = d | command;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;
#endif
	/////////////////////////////////////
	A0.type->BSRR = A0.pin;

#ifdef CLK_E	
	WR.type->BRR = WR.pin;
	
	D0.type->ODR = d | d0;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;

	D0.type->ODR = d | d1;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;

	D0.type->ODR = d | d2;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;

	D0.type->ODR = d | d3;
	RD.type->BSRR = RD.pin;
	RD.type->BRR = RD.pin;
#else	
	D0.type->ODR = d | d0;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;

	D0.type->ODR = d | d1;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;

	D0.type->ODR = d | d2;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;

	D0.type->ODR = d | d3;
	WR.type->BRR = WR.pin;
	WR.type->BSRR = WR.pin;
#endif	

	/////////////////////////////////////
	LCD_CS.type->BSRR = LCD_CS.pin;
}

u8 LCD_ReadU8(u8 command)
{
	LCD_WriteCommand0(command);

	LCD_ReadData(); // dummy

	return LCD_ReadData();
}

u16 LCD_ReadU16(u8 command)
{
	u16 data;
	LCD_WriteCommand0(command);

	LCD_ReadData(); // dummy

	data = LCD_ReadData(); // dummy
	data <<= 8;
	data += LCD_ReadData(); // dummy

	return data;
}

u32 LCD_ReadU32(u8 command)
{
	u32 data;
	LCD_WriteCommand0(command);

	LCD_ReadData(); // dummy

	data = LCD_ReadData(); // dummy
	data <<= 8;

	data += LCD_ReadData(); // dummy
	data <<= 8;

	data += LCD_ReadData(); // dummy
	data <<= 8;

	data += LCD_ReadData(); // dummy
	data <<= 8;

	return data;
}

#define LCD_NOP()											LCD_WriteCommand0(0x00)
#define LCD_SWReset()										LCD_WriteCommand0(0x01)
#define LCD_DummyRead()										LCD_ReadU32(0x04)
#define LCD_ReadRedColor() 									LCD_ReadU8(0x06)
#define LCD_ReadGreenColor() 								LCD_ReadU8(0x07)
#define LCD_ReadBlueColor()	 								LCD_ReadU8(0x08)
#define LCD_ReadStatus() 									LCD_ReadU32(0x09)
#define LCD_ReadDisplayPowerMode()	 						LCD_ReadU8(0x0a)
#define LCD_ReadDisplayMADCtrl()						 	LCD_ReadU8(0x0b)
#define LCD_ReadDisplayPixelFormat()						LCD_ReadU8(0x0c)
#define LCD_ReadDisplayImageMode()							LCD_ReadU8(0x0d)
#define LCD_ReadDisplaySignalMode()							LCD_ReadU8(0x0e)
#define LCD_ReadDisplayDiagnoseResult()						LCD_ReadU8(0x0f)

#define LCD_Sleep()											LCD_WriteCommand0(0x10)
#define LCD_Wake()											LCD_WriteCommand0(0x11)
#define LCD_SetPartialMode()								LCD_WriteCommand0(0x12)
#define LCD_SetNormalMode()									LCD_WriteCommand0(0x13)

#define LCD_SetInvertMode()									LCD_WriteCommand0(0x20)
#define LCD_ResetInvertMode()								LCD_WriteCommand0(0x21)

#define LCD_SetGamma(gamma)									LCD_WriteU8(0x26, gamma)

#define LCD_SetDisplayOff()									LCD_WriteCommand0(0x28)
#define LCD_SetDisplayOn()									LCD_WriteCommand0(0x29)
#define LCD_SetColumnAddress(start, end)					LCD_WriteCommand4(0x2a, start>>8, start, end>>8, end)
#define LCD_SetRowAddress(start, end)						LCD_WriteCommand4(0x2b, start>>8, start, end>>8, end)
#define LCD_StartWriteMemory()								LCD_WriteCommand0(0x2c)
#define LCD_EndWriteMemory()								LCD_NOP()
#define LCD_StartWritePalette()								LCD_WriteCommand0(0x2d)
#define LCD_EndWritePalette()								LCD_NOP()
#define LCD_StartReadMemory()								LCD_ReadU8(0x2e)
#define LCD_EndReadMemory()									LCD_NOP()
#define LCD_SetPartialArea(start, end) 						LCD_WriteCommand4(0x30, start>>8, start, end>>8, end)
#define LCD_SetScrollArea(tfa, vsa, bfa)					LCD_WriteCommand4(0x33, tfa>>8, tfa, vsa>>8, vsa); LCD_WriteData(bfa>>8) LCD_WriteData(bfa)
#define LCD_SetTearingLineOff()								LCD_WriteCommand0(0x34)
#define LCD_SetTearingLineOn(vblank)						LCD_WriteCommand1(0x35, vblank?1:0)
#define LCD_SetAddressMode(ml, bgr, ss)						LCD_WriteCommand1(0x36, ((ml?1:0)<<4) | ((bgr?1:0)<<3) | ((ss?1:0)<<2)) // 0x08
#define LCD_SetScrollStart(vsp)								LCD_WriteCommand4(0x37, vsp>>8, vsp)
#define LCD_ExitIdleMode()									LCD_WriteCommand0(0x38)
#define LCD_EnterIdleMode()									LCD_WriteCommand0(0x39)
#define LCD_SetDisplayPixelFormat(format)					LCD_WriteCommand1(0x3A, format)
#define LCD_WriteMemoryContinue()							LCD_WriteCommand0(0x3C)
#define LCD_ReadMemoryContinue()							LCD_ReadU8(0x3D)
#define LCD_SetTearingLine(line)							LCD_WriteCommand2(0x44, line>>8, line)
#define LCD_GetCurrentScanLine()							LCD_ReadU16(0x45)
#define LCD_SetBrightness(brightness)						LCD_WriteU8(0x51, brightness)
#define LCD_GetBrightness()									LCD_ReadU8(0x52)
#define LCD_SetDisplayControl(bctrl, dimming, bl)			LCD_WriteU8(0x53, ((bctrl?1:0)<<5) | ((dd?1:0)<<3) | ((bl?1:0)<<2))
#define LCD_GetDisplayControl(bctrl, dimming, bl)			LCD_ReadU8(0x54)
#define LCD_SetContentAdaptiveBrightnessControl(ctrl)		LCD_WriteU8(0x55, ctrl)
#define LCD_GetContentAdaptiveBrightnessControl()			(LCD_ReadU16(0x56)>>8)

void LCD_LoadPalette(PixelFormat format)
{
	u32 i;
	switch(format)
	{
		case PF_RGB888:
#ifdef LCD_TK022F2218
		// assert("PF_RGB888 not supported");
#endif		
		case PF_RGB666:
		{
			LCD_WriteCommand0(0x2D);
			for (i = 0; i <64; i++)
				LCD_WriteData(i * 4);

			for (i = 0; i <64; i++)
				LCD_WriteData(i * 4);

			for (i = 0; i <64; i++)
				LCD_WriteData(i * 4);
		}
		break;
		
		case PF_RGB565:
		{
			#ifdef LCD_TK022F2218
			LCD_WriteCommand0(0x2D);
			for(i=0;i<32;i++)  
				WriteData(i*2);  // RED 
			for(i=0;i<64;i++) 
				WriteData(i*1);   // Green  
			for(i=0;i<32;i++) 
				WriteData(i*2);  // Blue  
			#else
			LCD_WriteCommand0(0x2D);
			for (i = 0; i <64; i++)
			{
				if(i<32)
					LCD_WriteData(i * 8);
				else
					LCD_WriteData(0);
			}

