MacgyverLin/VGMPlayer/Software/STM32/HWModule/LCD2.c
void LCD_SetPixelFormat(PixelFormat pixelFormat)
{
	u8 data;

	switch(pixelFormat)
	{
		case PF_RGB888:
#ifdef LCD_TK022F2218
			// assert("PF_RGB888 not supported");
#else
			data = 0x77;
#endif		
		break;

		default:
		case PF_RGB565:
			data = 0x55;
		break;
		case PF_RGB666:
			data = 0x66;
		break;
		case PF_RGB444:
#ifdef LCD_TK022F2218
			data = 0x33;
#else
			// assert("PF_RGB888 not supported");	
#endif				
		break;	
	};

	LCD_WriteCommand0(0x3A);
	LCD_WriteData(data);
}

void LCD_TurnOnDisplay(void)
{
	LCD_WriteCommand0(0x29);  //Display on 
}

void LCD_Initialize(void)
{
	u32 w = 0;

	LCD_Config_GPIO();
	LCD_Reset();

	LCD_SetRegisters();

#ifdef COLOR565	
	LCD_LoadPalette(PF_RGB565);	
	LCD_SetPixelFormat(PF_RGB565);
	//LCD_SetPixelFormat(PF_RGB444);	
	//LCD_SetPixelFormat(PF_RGB666);
#else
	LCD_LoadPalette(PF_RGB888);
	LCD_SetPixelFormat(PF_RGB888);
#endif	
	//LCD_SetAddressMode(0, 1, 0);
	LCD_SetDisplayOn();
	//LCD_SetDisplayOff();
	delay_us(120);

	while (1)
	{
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0x00, 0x00, 0x00); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0x00, 0x00, 0x7f); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0x00, 0x7f, 0x00); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0x00, 0x7f, 0x7f); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0x7f, 0x00, 0x00); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0x7f, 0x00, 0x7f); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0x7f, 0x7f, 0x00); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0x7f, 0x7f, 0x7f); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0x00, 0x00, 0xff); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0x00, 0xff, 0x00); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0x00, 0xff, 0xff); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0xff, 0x00, 0x00); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0xff, 0x00, 0xff); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0xff, 0xff, 0x00); w += 5;
		delay_ms(100);
		LCD_DrawRect(w, w, SCREEN_WIDTH - w * 2, SCREEN_HEIGHT - w * 2, 0xff, 0xff, 0xff); w += 5;
		delay_ms(20000);
		w = 0;
	}
}

void LCD_WR_REG(u8 address, u8 data)
{
	LCD_WriteCommand0(address);

	LCD_WriteData(data);
}

void LCD_DrawRect565(u32 x, u32 y, u32 w, u32 h, u8 r, u8 g, u8 b)
{
	u16 d0;
	u16 d1;
	u16 d2;
	u32 count = w * h;
	u32 xEnd = x + w - 1;
	u32 yEnd = y + h - 1;
	u32 color = RGB565(r, g, b);
	u16 d = GET_DATA() & 0xff00;
	d1 = d | (color >> 8);
	d0 = d | (color & 0xff);

	LCD_SetColumnAddress(x, xEnd);
	LCD_SetRowAddress(y, yEnd);
	LCD_StartWriteMemory();

	////////////////////////////////////////////////////
	IO_WRITE(A0, 1);
	IO_WRITE(LCD_CS, 0);
	while(count--)
	{
		SET_DATA(d1);

		TOGGLE_WR();

		SET_DATA(d0);

		TOGGLE_WR();
	}

	IO_WRITE(LCD_CS, 1);
	//////////////////////////////////////////////////////
}

void LCD_DrawRect888(u32 x, u32 y, u32 w, u32 h, u8 r, u8 g, u8 b)
{
	u16 d0;
	u16 d1;
	u16 d2;
	u32 count = w * h;
	u32 xEnd = x + w - 1;
	u32 yEnd = y + h - 1;
	u32 color = RGB888(r, g, b);
	u16 d = GET_DATA() & 0xff00;
	
	d2 = d | r;
	d1 = d | g;
	d0 = d | b;
	LCD_SetColumnAddress(x, xEnd);
	LCD_SetRowAddress(y, yEnd);
	LCD_StartWriteMemory();

	////////////////////////////////////////////////////
	IO_WRITE(A0, 1);
	IO_WRITE(LCD_CS, 0);

	while(count--)
	{
		SET_DATA(d2);

		TOGGLE_WR();

		SET_DATA(d1);

		TOGGLE_WR();
		
		SET_DATA(d0);

		TOGGLE_WR();
	}

	IO_WRITE(LCD_CS, 1);
	//////////////////////////////////////////////////////
}

void LCD_DrawJPEG888(u32 x, u32 y, const u8* filename)
{
	JPEG* jpeg = JPEG_Open(filename);

	char* buffer = (char*)malloc(jpeg->cinfo.output_components*jpeg->cinfo.output_width);
	
	JPEG_DecodeScanLine(jpeg, &buffer);
	
	free(buffer);

	JPEG_Close(jpeg);
}

void LCD_DrawJPEG565(u32 x, u32 y, const u8* filename)
{
	JPEG* jpeg = JPEG_Open(filename);

	char* buffer = (char*)malloc(jpeg->cinfo.output_components*jpeg->cinfo.output_width);
	
	JPEG_DecodeScanLine(jpeg, &buffer);
	
	free(buffer);

	JPEG_Close(jpeg);	
}